# Lab | Data Structuring and Combining Data

## Challenge 1: Combining & Cleaning Data

In this challenge, we will be working with the customer data from an insurance company, as we did in the two previous labs. The data can be found here:
- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

But this time, we got new data, which can be found in the following 2 CSV files located at the links below.

- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv
- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file3.csv

Note that you'll need to clean and format the new data.

Observation:
- One option is to first combine the three datasets and then apply the cleaning function to the new combined dataset
- Another option would be to read the clean file you saved in the previous lab, and just clean the two new files and concatenate the three clean datasets

In [1]:
# Loading datasets :

# url_1 = "https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv"
# url_2 = "https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv"
# url_3 = "https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file3.csv"

import pandas as pd

source_1 = "file1.csv"
source_2 = "file2.csv"
source_3 = "file3.csv"

df_1 = pd.read_csv(source_1)
df_2 = pd.read_csv(source_2)
df_3 = pd.read_csv(source_3)

#### Glancing at each dataset individually

In [2]:
print(df_1.shape,df_2.shape,df_3.shape)

(4008, 11) (996, 11) (7070, 11)

In [3]:
df_1.head(2)

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935

In [4]:
df_2.head(2)

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Total Claim Amount,Policy Type,Vehicle Class
0,GS98873,Arizona,F,Bachelor,323912.47%,16061,88,1/0/00,633.6,Personal Auto,Four-Door Car
1,CW49887,California,F,Master,462680.11%,79487,114,1/0/00,547.2,Special Auto,SUV

In [5]:
df_3.head(2)

,Customer,State,Customer Lifetime Value,Education,Gender,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Total Claim Amount,Vehicle Class
0,SA25987,Washington,3479.137523,High School or Below,M,0,104,0,Personal Auto,499.200000,Two-Door Car
1,TB86706,Arizona,2502.637401,Master,M,0,66,0,Personal Auto,3.468912,Two-Door Car

In [6]:
# Renaming columns in preparation of columns reordering

df_1.rename(columns= {'ST': 'state'}, inplace=True)
df_2.rename(columns= {'ST': 'state'}, inplace=True)
df_3.rename(columns= {'State': 'state'}, inplace=True)

df_1.rename(columns= {'GENDER': 'gender'}, inplace=True)
df_2.rename(columns= {'GENDER': 'gender'}, inplace=True)
df_3.rename(columns= {'Gender': 'gender'}, inplace=True)

# Reordering columns
cols = ['Customer', 
        'state', 
        'gender', 
        'Education', 
        'Customer Lifetime Value', 
        'Income', 
        'Monthly Premium Auto', 
        'Number of Open Complaints', 
        'Policy Type', 
        'Vehicle Class', 
        'Total Claim Amount']
df_2 = df_2[cols]
df_3 = df_3[cols]

# Concatenating the 3 datasets into a dataframe:

df = pd.concat([df_1,df_2,df_3], axis=0)

df.shape

(12074, 11)

In [7]:
df.head(3)

,Customer,state,gender,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247

In [8]:
# Applying clean up & formating functions:

def fix_col_names(df):
    df.columns = df.columns.str.strip().str.lower().str.replace(r'\s+','_',regex=True)
    return df

# replacing spaces with _
fix_col_names(df)

df.head(2)

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935

In [9]:
### DATA CLEANING:

# fixing 'gender'
df['gender'] = df['gender'].replace(regex={r'Femal': 'F', 'female':'F','Male' : 'M', 'M':'M', 'F':'F' })

# fixing 'state'
df['state'] = df['state'].apply(lambda x: "California" if x == "Cali" else ("Washington" if x == "WA" else ("Arizona" if x== "AZ" else x))  )

# fixing 'vehicle_class'
df['vehicle_class'] = df['vehicle_class'].replace(regex={r'Sports Car': 'Luxury', 'Luxury SUV':'Luxury','Luxury Car' : 'Luxury'})

# replacing Bachelors" by "Bachelor" in 'education'
df['education'] = df['education'].str.replace('Bachelors','Bachelor')

# Removing % character in 'customer_lifetime_value'
df['customer_lifetime_value'] = df['customer_lifetime_value'].str.replace('%','')

# replacing Sports Car", "Luxury SUV" and "Luxury Car" by "Luxury"
df['vehicle_class'] = df['vehicle_class'].replace(regex={r'Sports Car': 'Luxury', 'Luxury SUV':'Luxury','Luxury Car' : 'Luxury'})

# changing 'customer_lifetime_value' into a float and divide by 100
df['customer_lifetime_value'] = df['customer_lifetime_value'].apply(float) / 100

# changing reformatting 'number_of_open_complaints' from 1/x/00 into x
df['number_of_open_complaints'] = df['number_of_open_complaints'].apply(lambda x: x.split("/")[1] if isinstance(x,str) else x )

# changing 'number_of_open_complaints' into a float
df['number_of_open_complaints'] = df['number_of_open_complaints'].apply(float)

In [10]:
# Checking clean up changes applied

df.head(4)

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,0.0,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,6979.5359,0.0,94.0,0.0,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,12887.4317,48767.0,108.0,0.0,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,7645.8618,0.0,106.0,0.0,Corporate Auto,SUV,529.881344

# Challenge 2: Structuring Data

In this challenge, we will continue to work with customer data from an insurance company, but we will use a dataset with more columns, called marketing_customer_analysis.csv, which can be found at the following link:

https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis_clean.csv

This dataset contains information such as customer demographics, policy details, vehicle information, and the customer's response to the last marketing campaign. Our goal is to explore and analyze this data by performing data cleaning, formatting, and structuring.

In [ ]:
url_4 = "https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis_clean.csv"

source_3 = "marketing_customer_analysis_clean.csv"

df = pd.read_csv(source_4)

1. You work at the marketing department and you want to know which sales channel brought the most sales in terms of total revenue. Using pivot, create a summary table showing the total revenue for each sales channel (branch, call center, web, and mail).
Round the total revenue to 2 decimal points.  Analyze the resulting table to draw insights.

2. Create a pivot table that shows the average customer lifetime value per gender and education level. Analyze the resulting table to draw insights.

## Bonus

You work at the customer service department and you want to know which months had the highest number of complaints by policy type category. Create a summary table showing the number of complaints by policy type and month.
Show it in a long format table.

*In data analysis, a long format table is a way of structuring data in which each observation or measurement is stored in a separate row of the table. The key characteristic of a long format table is that each column represents a single variable, and each row represents a single observation of that variable.*

*More information about long and wide format tables here: https://www.statology.org/long-vs-wide-data/*

In [ ]:
# Your code goes here